<center>
![](gerb.jpg)

<br>

<font size="5">МИНОБРНАУКИ РОССИИ</font><br><br>
<font size="4">
Федеральное государственное бюджетное
образовательное учреждение высшего образования
</font><br>
<font size="5">**«МИРЭА – РОССИЙСКИЙ ТЕХНОЛОГИЧЕСКИЙ УНИВЕРСИТЕТ»**</font><br><br>
<font size="4">Лабораторная работа по дисциплине:<br>
«Программные средства оперативно-аналитического поиска»<br><br>
Тема: Исследование сетевых параметров публичных DNS серверов<br><br><br><br><br><br><br>
</center>
<div style="text-align: right">
Выполнил:<br>
Студент 4 курса<br>
Специальности 10.05.05<br>
Группа ББСО-02-16<br>
Кузнецов Е.А.<br>
Проверил:<br>
Захарчук И.И.<br>
</div>
<br><br><br><br><br>
<center>Москва, 2020</center><br><br><br>
</font>

<font size="5">
**Цель работы:**
</font>

<font size="4">
Проанализировать сетевые параметры публичных DNS серверов, сделать мотивированный вывод о предпочтительных серверах.
</font>
<br><br>

<font size="5">
**Исходные данные:**
</font>

<font size="4">

1. Lenovo ideapad 330;

2. OS Linux (Kali Linux);

3. Rstudio IDE;

</font><br>

<font size="5">
**Исследуемые провайдеры DNS**
</font>

<font size="4">

1. Google Public DNS;

2. Cloudflare DNS;

3. OpenDNS;

4. DNS вашего провайдера.

</font><br>

<font size="5">
**План выполнения работы:**
</font>

<font size="4">

1. По исследуемым серверам собрать следующие данные:

<div style="margin-left:40px">

+ маршрут;

+ местоположение каждого узла маршрута к DNS-серверу;

+ организацию, владеющую каждым узлом маршрута к DNS-серверу;

+ среднюю RTT к DNS-серверу;

</div>

2. Выделить те узлы маршрута, которые вносят наибольшую временную задержку при передаче;

3. Сравнить сетевые параметры DNS серверов.

</font><br>

<font size="5">
**Ход выполнения работы:**
</font>

<font size="4">

1. Google Public DNS - Google Public DNS — интернет-сервис корпорации Google, предоставляющий общедоступные DNS-серверы. Открыт в декабре 2009 года. По словам компании, обеспечивает ускорение загрузки веб-страниц за счет повышения эффективности кэширования данных, а также улучшенную защиту от спуфинга.

<div style="margin-left:40px">
Google Public DNS предоставляет следующие адреса публичных серверов для DNS-запросов:

+ **8.8.8.8**

№    | ping_1  | ping_2  | ping_3  |                      Узел                             |  Местоположение      | Организация
:---:|:-------:|:-------:|:-------:|:-----------------------------------------------------:|:--------------------:|:-----------:
1    |   2ms   |   1ms   |   1ms   |rt [192.168.0.1]                                       |Russia, Moscow        |Домашний роутер    
2    |   3ms   |   3ms   |   3ms   |broadband-90-154-77-195.ip.moscow.rt.ru [90.154.77.195]|Russia, Moscow        | Rostelecom
3    |    *    |    *    |    *    |Превышен интервал ожидания для запроса.                |       N/A            | N/A
**4**|**24ms** |**4ms**  |**5ms**  |**77.37.250.249**                                      |**Russia, Moscow**    |**Rostelecom**
5    |   8ms   |   7ms   |   4ms   |72.14.209.81                                           |USA, Mountain View    | Google
**6**|**13ms** |**9ms**  |**5ms**  |**108.170.250.83**                                     |**USa, Mountain View**|**Google**
**7**|**19ms** |**21ms** |**18ms** |**216.239.50.2**                                       |**USa, Mountain View**|**Google**
**8**|**25ms** |**20ms** |**20ms** |**72.14.236.117**                                      |**USa, Mountain View**|**Google**
9    |    *    |    *    |    *    |Превышен интервал ожидания для запроса.                |       N/A            | N/A
10   |    *    |    *    |    *    |Превышен интервал ожидания для запроса.                |       N/A            | N/A
11   |    *    |    *    |    *    |Превышен интервал ожидания для запроса.                |       N/A            | N/A
12   |    *    |    *    |    *    |Превышен интервал ожидания для запроса.                |       N/A            | N/A
13   |    *    |    *    |    *    |Превышен интервал ожидания для запроса.                |       N/A            | N/A
14   |    *    |    *    |    *    |Превышен интервал ожидания для запроса.                |       N/A            | N/A
15   |    *    |    *    |    *    |Превышен интервал ожидания для запроса.                |       N/A            | N/A
16   |    *    |    *    |    *    |Превышен интервал ожидания для запроса.                |       N/A            | N/A
17   |    *    |    *    |    *    |Превышен интервал ожидания для запроса.                |       N/A            | N/A
18   |    *    |    *    |    *    |Превышен интервал ожидания для запроса.                |       N/A            | N/A
19   |    *    |    *    |    *    |Превышен интервал ожидания для запроса.                |       N/A            | N/A
**20**|**17ms**|**17ms** |**17ms** |**dns.google [8.8.8.8]**                               |**USa, Mountain View**|**Google**

RTT = 17ms Трассировка завершена
<br><br>

+ **8.8.4.4**

№     | ping_1  | ping_2  | ping_3  |                      Узел             |  Местоположение      | Организация
:----:|:-------:|:-------:|:-------:|:-------------------------------------:|:--------------------:|:-----------:
1     |   1ms   |   1ms   |   1ms   |rt [192.168.0.1]                       |Russia, Moscow        |Домашний роутер    
2     |    *    |    *    |    *    |Превышен интервал ожидания для запроса.|       N/A            | N/A
3     |    *    |    *    |   5ms   |77.37.250.196                          |Russia, Moscow        | Rostelecom 
4     |    *    |   4ms   |   4ms   |77.37.250.249                          |Russia, Moscow        | Rostelecom
5     |   5ms   |   4ms   |   3ms   |72.14.209.81                           |USA, Mountain View    | Google 
6     |   5ms   |   5ms   |   5ms   |108.170.250.113                        |USA, Mountain View    | Google
**7** |**21ms** |**21ms** |**20ms** |**216.239.51.32**                      |**USA, Mountain View**|**Google**
**8** |**20ms** |**37ms** |**28ms** |**74.125.253.109**                     |**USA, Mountain View**|**Google**
**9** |**21ms** |**21ms** |**22ms** |**209.85.251.41**                      |**USA, Mountain View**|**Google** 
10    |    *    |    *    |    *    |Превышен интервал ожидания для запроса.|       N/A            | N/A
11    |    *    |    *    |    *    |Превышен интервал ожидания для запроса.|       N/A            | N/A
12    |    *    |    *    |    *    |Превышен интервал ожидания для запроса.|       N/A            | N/A
13    |    *    |    *    |    *    |Превышен интервал ожидания для запроса.|       N/A            | N/A
14    |    *    |    *    |    *    |Превышен интервал ожидания для запроса.|       N/A            | N/A
15    |    *    |    *    |    *    |Превышен интервал ожидания для запроса.|       N/A            | N/A
16    |    *    |    *    |    *    |Превышен интервал ожидания для запроса.|       N/A            | N/A
17    |    *    |    *    |    *    |Превышен интервал ожидания для запроса.|       N/A            | N/A
18    |    *    |    *    |    *    |Превышен интервал ожидания для запроса.|       N/A            | N/A
**19**|**17ms** |**17ms** |**17ms** |**dns.google [8.8.8.8]**               |**USa, Mountain View**|**Google**

RTT = 19ms Трассировка завершена
</div>
<br><br><br> 
 
2. Cloudflare DNS - Американская компания, предоставляющая услуги CDN, защиту от DDoS-атак, безопасный доступ к ресурсам и серверы DNS. Сервисы Cloudflare работают как обратный прокси для сайта.

№  | ping_1  | ping_2  | ping_3  |                      Узел                            | Местоположение              | Организация
:-:|:-------:|:-------:|:-------:|:----------------------------------------------------:|:---------------------------:|:-----------:
1  |   1ms   |   1ms   |   1ms   |rt [192.168.0.1]                                      |Russia, Moscow               | Домашний роутер   
2  |    *    |    *    |    *    |Превышен интервал ожидания для запроса.               |       N/A                   | N/A
3  |    *    |   3ms   |   3ms   |77.37.250.196                                         |Russia, Moscow               | Rostelecom 
4  |    *    |   5ms   |   5ms   |87.226.221.70                                         |Russia, Moscow               | Rostelecom        
5  |   4ms   |   4ms   |   4ms   |188.254.25.75                                         |Russia, Moscow               | Rostelecom
**6** |**41ms** |**45ms** |**41ms** |**217.161.68.34**                                     |**UK, London**               |**Customer P2P links**
**7** |**479ms**|    *    |    *    |**217.161.68.33**                                     |**UK, London**               |**Customer P2P links**
**8** |**62ms** |**56ms** |**58ms** |**lag-120.ear2.Frankfurt1.Level3.net [4.68.70.37]**   |**USA, Monroe**              |**Level 3 Parent, LLC (LPL-141)**          
**9** |    *    |**86ms** |**99ms** |**ae-2-3216.ear4.Frankfurt1.Level3.net [4.69.210.66]**|**USA, Monroe**              |**Level 3 Parent, LLC (LPL-141)**
**10**|**60ms** |    *    |**146ms**|**195.122.183.210**                                   |**Germany,  Bremenhaven**    |**Level (3) Communications**
**11**|**61ms** |**52ms** |**68ms** |**one.one.one.one [1.1.1.1]**                         |**Australia, South Brisbane**|**Cloudflare DNS**

RTT = 188ms Трассировка завершена.
<br><br><br>

3. OpenDNS - интернет-служба, предоставляющая общедоступные DNS-серверы.

№    | ping_1  | ping_2  | ping_3  |                      Узел                     |     Местоположение      | Организация
:---:|:-------:|:-------:|:-------:|:---------------------------------------------:|:-----------------------:|:-----------:
1    |   2ms   |   1ms   |   2ms   |rt [192.168.0.1]                               |Russia, Moscow           | Домашний роутер   
2    |    *    |    *    |    *    |Превышен интервал ожидания для запроса.        |       N/A               | N/A 
3    |   3ms   |   4ms   |   3ms   |77.37.250.196                                  |Russia, Moscow           | Rostelecom
4    |    *    |   5ms   |    *    |87.226.221.70                                  |Russia, Moscow           | Rostelecom      
**5**|**30ms** |**25ms** |**25ms** |**188.254.26.51**                              |**Russia, Moscow**       |**Rostelecom**            
**6**|**32ms** |**33ms** |**32ms** |**ae1-500.cr1-stk3.ip4.gtt.net [77.67.90.96]** |**Germany, Neu-Isenburg**|**Tinet International Network**
**7**|**49ms** |**51ms** |**50ms** |**ae13.cr5-ams1.ip4.gtt.net [213.200.117.202]**|**Germany, Neu-Isenburg**|**Tinet International Network**
**8**|**75ms** |**66ms** |**72ms** |**opendns-gw.ip4.gtt.net [77.67.66.70]**       |**Germany, Neu-Isenburg**|**Tinet International Network**
**9**|**73ms** |**78ms** |**74ms** |**resolver2.opendns.com [208.67.220.220]**     |**USA, San Francisco**   |**Cisco OpenDNS**

RTT = 73ms Трассировка завершена.
<br><br><br>

4. Rostelecom - Компания Ростелеком является крупнейшим в России Интернет-провайдером, предоставляющим своим пользователям качественные услуги широкополосного доступа к скоростному интернету, используя самые современные технологии.

№  | ping_1  | ping_2  | ping_3  |                      Узел                             | Местоположение | Организация
:-:|:-------:|:-------:|:-------:|:-----------------------------------------------------:|:--------------:|:-----------:
1  |    3ms  |    3ms  |   1ms   |rt [192.168.0.1]                                       |Russia, Moscow  | Домашний роутер   
2  |    6ms  |    3ms  |   3ms   |broadband-90-154-77-195.ip.moscow.rt.ru [90.154.77.195]|Russia, Moscow  | Rostelecom
3  |    5ms  |    3ms  |   3ms   |m10-cr01-be4-91.msk.ip.ncnet.ru [77.37.254.197]        |Russia, Moscow  | Rostelecom 
4  |    3ms  |    4ms  |   5ms   |77.37.254.196                                          |Russia, Moscow  | Rostelecom            
5  |     *   |    5ms  |   5ms   |bgw-3-ge3-2-15.msk.ip.ncnet.ru [77.37.251.1]           |Russia, Moscow  | Rostelecom           
6  |    5ms  |    4ms  |   4ms   |broadband-77-37-251-7.ip.moscow.rt.ru [77.37.251.7]    |Russia, Moscow  | Rostelecom

RTT = 4ms Трассировка завершена.

</font>


















